import { FlatAyah } from "./types";

export const INITIAL_AYAHS: FlatAyah[] = [
  {
    "surah_id": 1,
    "ayah_id": 1,
    "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 1,
    "ayah_id": 2,
    "text": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 1,
    "ayah_id": 3,
    "text": "الرَّحْمَٰنِ الرَّحِيمِ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 1,
    "ayah_id": 4,
    "text": "مَالِكِ يَوْمِ الدِّينِ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 1,
    "ayah_id": 5,
    "text": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 1,
    "ayah_id": 6,
    "text": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 1,
    "ayah_id": 7,
    "text": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
    "surah_name": "الفاتحة"
  },
  {
    "surah_id": 2,
    "ayah_id": 1,
    "text": "الم",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 2,
    "text": "ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 3,
    "text": "الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 4,
    "text": "وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 5,
    "text": "أُولَٰئِكَ عَلَىٰ هُدًى مِّن رَّبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 6,
    "text": "إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 7,
    "text": "خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 8,
    "text": "وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُم بِمُؤْمِنِينَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 9,
    "text": "يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 10,
    "text": "فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 11,
    "text": "وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 12,
    "text": "أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَٰكِن لَّا يَشْعُرُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 13,
    "text": "وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ ۗ أَلَا إِنَّهُمْ هُمُ السُّفَهَاءُ وَلَٰكِن لَّا يَعْلَمُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 14,
    "text": "وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَىٰ شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 15,
    "text": "اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 16,
    "text": "أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ فَمَا رَبِحَت تِّجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 17,
    "text": "مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَّا يُبْصِرُونَ",
    "surah_name": "البقرة"
  },
  {
    "surah_id": 2,
    "ayah_id": 18,
    "text": "صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ",
    "surah_name": "البقرة"
  }
];
